---
kind: method
id: M:Autodesk.Revit.DB.BaseImportOptions.GetLayerSelection
source: html/74b144b8-0906-bba0-0bac-30d058481422.htm
---
# Autodesk.Revit.DB.BaseImportOptions.GetLayerSelection Method

Get all set layers name which user want to import into Revit.

## Syntax (C#)
```csharp
public ICollection<string> GetLayerSelection()
```

## Returns
The layers' name.